ClientTest/Xml/postjob.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink">uIDPo4AbllHW3wNPoeVLc3nu1bcAAAAAAQPdsCKKY0WPtygZPxtJsJE3iq9Mnd1NkZCGdEBjfcYACQAA</VsDebuggerCausalityData>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <AirShoppingRQ Version="16.1" xmlns="http://www.iata.org/IATA/EDIST">
      <Document>
        <Name>BA</Name>
      </Document>
      <Party>
        <Sender>
          <TravelAgencySender>
            <Name>Travel Centre Clapham</Name>
            <Contacts>
              <Contact>
                <EmailContact>
                  <Address>ndc@ba.com</Address>
                </EmailContact>
              </Contact>
            </Contacts>
            <IATA_Number>91210092</IATA_Number>
            <AgencyID>Travel Centre Clapham Limited</AgencyID>
          </TravelAgencySender>
        </Sender>
        <Participants xsi:nil="true"/>
        <Recipient xsi:nil="true"/>
      </Party>
      <Travelers>
        <Traveler>
          <AnonymousTraveler>
            <PTC>ADT</PTC>
            <Age>
              <BirthDate>1988-06-07</BirthDate>
            </Age>
          </AnonymousTraveler>
        </Traveler>
      </Travelers>
      <CoreQuery>
        <OriginDestinations>
          <OriginDestination>
            <Departure>
              <AirportCode>LHR</AirportCode>
              <Date>2018-08-26</Date>
            </Departure>
            <Arrival>
              <AirportCode>DME</AirportCode>
            </Arrival>
          </OriginDestination>
          <OriginDestination>
            <Departure>
              <AirportCode>DME</AirportCode>
              <Date>2018-09-26</Date>
            </Departure>
            <Arrival>
              <AirportCode>LHR</AirportCode>
            </Arrival>
          </OriginDestination>
        </OriginDestinations>
      </CoreQuery>
      <Preference>
        <FarePreferences>
          <Types>
            <Type>
              <Code>759</Code>
            </Type>
          </Types>
        </FarePreferences>
        <CabinPreferences>
          <CabinType>
            <Code>5</Code>
          </CabinType>
        </CabinPreferences>
      </Preference>
    </AirShoppingRQ>
  </s:Body>
</s:Envelope>